import struct
import sys
import time

from unions import Unions


# Определение структуры
class S_UDP_PACK_ODS_DATA:
    def __init__(self):
        self.unions = Unions()
        self.upd = {
            "preface_1": 0xCD,  # Преамбула	0xCDEFFA01
            "preface_2": 0xEF,  # Преамбула
            "preface_3": 0xFA,  # Преамбула
            "preface_4": 0x01,  # Преамбула
            "reciever_addr": 0x0001,  # Адресат пакета 0x0001
            "sender_addr": 0x0002,  # Источник пакета 0x0002
            "id": 0x0003,  # № пакета 0x0003
            "reserv_1": 0x0000,
            "reserv_2": 0x0000,
            "reserv_3": 0x0000,
            "size": 0x0242,  # Длина всего пакета 0x03A2
            "sds1": struct.unpack("H", self.unions.sds1_data)[0],
            "_reserve0": 0x0000,
            "sds2": struct.unpack("H", self.unions.sds2_data)[0],
            "sds3": struct.unpack("H", self.unions.sds3_data)[0],
            "r0": 0x0000,
            "r1": 0x0000,
            "r2": 0x0000,
            "r3": 0x0000,
            "r4": 0x0000,
            "r5": 0x0000,
            "r6": 0x0000,
            "r7": 0x0000,
            "r8": 0x0000,
            "r9": 0x0000,
            "r10": 0x0000,
            "r11": 0x0000,
            "r12": 0x0000,
            "preface_ar_1": 0xA1FA,  # Преамбула канала ARINC-429 №1(Данные ИНС) ВПНП-1М */
            "cnt_p1": 0x00000000,  # Счетчик посылок
            "sds_01_p1": struct.unpack("I", self.unions.sds_01_p1_data)[0],
            "sds_02_p1": struct.unpack("I", self.unions.sds_02_p1_data)[0],
            "sds_03_p1": struct.unpack("I", self.unions.sds_03_p1_data)[0],
            "sds_04_p1": 0x00000000,  # СДС 4
            "sds_05_p1": 0x00000000,  # СДС 5
            "pitch": 0x00000000,  # Угол тангажа
            "roll": 0x00000000,  # Угол крена
            "course_mag": 0x00000000,  # Курс магнитный
            "course_track_mag": 0x00000000,  # Магнитный путевой угол
            "course_true": 0x00000000,  # Истинный курс
            "course_gyro": 0x00000000,  # Гироскопический курс
            "w_x": 0x00000000,  # Угловая скорость тангажа
            "w_y": 0x00000000,  # Угловая скорость крена
            "w_z": 0x00000000,  # Угловая скорость рысканья
            "n_x": 0x00000000,  # Продольное ускорение
            "n_y": 0x00000000,  # Боковое ускорение
            "n_z": 0x00000000,  # Нормальное ускорение
            "L_clx_head": 0x00000000,  # Географические координаты долгота старшая часть
            "L_clx_tail": 0x00000000,  # Географические координаты долгота младшая часть
            "B_clx_head": 0x00000000,  # Географические координаты широта старшая часть
            "B_clx_tail": 0x00000000,  # Географические координаты широта младшая часть
            "H_cmplx": 0x00000000,  # Комплексная высота полета
            "H_otn": 0x00000000,  # Относительная барометрическая высота
            "a_vert": 0x00000000,  # Вертикальное ускорение
            "speed_vert": 0x00000000,  # Вертикальная скорость
            "speed_vert_pot": 0x00000000,  # Потенциальная вертикальная скорость
            "v_north": 0x00000000,  # Путевая скорость N/S
            "v_east": 0x00000000,  # Путевая скорость E/W
            "speed_track": 0x00000000,  # Путевая скорость
            "a_course": 0x00000000,  # Ускорение вдоль траектории полета
            "traj_slope": 0x00000000,  # Угол наклона траектории
            "drift_angle": 0x00000000,  # Угол сноса
            "wind_speed": 0x00000000,  # Скорость ветра
            "wind_angle_mag": 0x00000000,  # Магнитное направление ветра
            "mult_txt": 0x00000000,  # Мультиплексор ТЕХН
            "time_on": 0x00000000,  # Время от включения 005
            "time_nav": 0x00000000,  # Время от начала навигации 006
            "reserv_4": 0x00000000,
            "reserv_5": 0x00000000,
            "reserv_6": 0x00000000,
            "reserv_7": 0x00000000,
            "reserv_8": 0x00000000,
            "reserv_9": 0x00000000,
            "reserv_10": 0x00000000,
            "reserv_11": 0x00000000,
            "p1_end_sig": 0xAF1A,  # Индентификатор окончания пакета №1
            "reserv_12": 0x00000000,  # !!!
            # /******/
            # /* P2 */
            # /******/
            "preface_ar_2": 0xA2FA,  # Преамбула канала ARINC-429 №2(Данные СВС) ВПНП-1М
            "sds_01_p2": 0x00000000,  # СДС 1
            "sds_02_p2": 0x00000000,  # СДС 2
            "H_abs": 0x00000000,  # абсолютная барометрическая высота [м]
            "H_qnh": 0x00000000,  # относительная баровысота (коррекция по QNH) [м]
            "H_qfe": 0x00000000,  # относительная баровысота (коррекция по QFE) [м]
            "airspeed_true": 0x00000000,  # истинная (воздушная) скорость [км/ч]
            "airspeed_prib": 0x00000000,  # приборная скорость [км/ч]
            "speed_vert_svs": 0x00000000,  # вертикальная скорость [м/с]
            "M": 0x00000000,  # число Маха полета [ед.М]
            "temp_h": 0x00000000,  # температура наружного воздуха [°С]
            "temp_r": 0x00000000,  # температура торможения [°С]
            "Q": 0x00000000,  # скоростной напор [Па]
            "P_f": 0x00000000,  # Полное давление [мм.рт.ст]
            "P_h_stat": 0x00000000,  # статическое давление воздуха [мм.рт.ст]
            "Td1": 0x00000000,  # температура датчика давления воздуха Д1 [°С]
            "Td2": 0x00000000,  # температура датчика давления воздуха Д2 [°С]
            "reserv_13": 0x00000000,
            "reserv_14": 0x00000000,
            "reserv_15": 0x00000000,
            "reserv_16": 0x00000000,
            "altitude_danger": 0x00000000,  # опасная высота
            "radio_altitude": 0x00000000,  # Высота от Радиовысотомера
            "altitude_trend": 0x00000000,  # Тренд высоты Habs
            "speed_trend": 0x00000000,  # Тренд скорости приборной
            "p2_end_sig": 0xAF2A,
            # /******/
            # /* P3 */
            # /******/
            "preface_ar_3": 0xA3FA,  # Преамбула канала ARINC-429 №3(Данные СНС) ВПНП-1М
            "cnt_p3": 0x00000000,  # Счетчик посылок
            "sds_01_p3": struct.unpack("I", self.unions.sds_01_p3_data)[0],
            "sds_02_p3": 0x00000000,  # СДС 2
            "sds_03_p3": 0x00000000,  # СДС 3
            "hdop": 0x00000000,  # Геометрический фактор HDOP умноженный на 10
            "vdop": 0x00000000,  # Геометрический фактор VDOP умноженный на 10
            "pdop": 0x00000000,  # Геометрический фактор PDOP умноженный на 10
            "vertical_speed_sns": 0x00000000,  # вертикальная скорость
            "speed_track_sns": 0x00000000,  # Путевая скорость
            "v_north_sns": 0x00000000,  # Путевая скорость N/S
            "v_east_sns": 0x00000000,  # Путевая скорость E/W
            "track_angle_sns": 0x00000000,  # путевой угол
            "H_sns": 0x00000000,  # высота СНС [м]
            "L_clx_head_sns": 0x00000000,  # Географические координаты долгота старшая часть
            "L_clx_tail_sns": 0x00000000,  # Географические координаты долгота младшая часть
            "B_clx_head_sns": 0x00000000,  # Географические координаты широта старшая часть
            "B_clx_tail_sns": 0x00000000,  # Географические координаты широта младшая часть
            "time_cur": 0x00000000,  # Текущее время
            "date_cur": 0x00000000,  # Текущая дата
            "reserv_21": 0x00000000,
            "reserv_22": 0x00000000,
            "reserv_23": 0x00000000,
            "reserv_24": 0x00000000,
            "reserv_25": 0x00000000,
            "reserv_26": 0x00000000,
            "reserv_27": 0x00000000,
            "reserv_28": 0x00000000,
            "p3_end_sig": 0x3AAF
        }

        # self.upd_sruct = (
        #     (self.upd["preface_1"] << 48)
        #     | (self.upd["preface_2"] << 32)
        #     | (self.upd["preface_3"] << 16)
        #     | self.upd["preface_4"]
        # )


start = time.time()
# Создание экземпляра структуры
udp_pack = S_UDP_PACK_ODS_DATA()
print(udp_pack.upd["sds1"])

packed_data = struct.pack("H" * 28 + "I" * 76, *udp_pack.upd.values())

print(packed_data)
print(sys.getsizeof(packed_data) - sys.getsizeof(b""))
un = struct.unpack("H" * 28 + "I" * 76, packed_data)
print(un)
print(len(un))
print(time.time() - start)
# # Отправка данных по UDP
# UDP_IP = "127.0.0.1"  # IP адрес получателя
# UDP_PORT = 1234  # Порт получателя
#
# sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
# sock.sendto(packed_data, (UDP_IP, UDP_PORT))
# sock.close()
